# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_container_registry.altinncr: Reading...
data.azurerm_container_registry.altinncr: Read complete after 0s [id=/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.container_app will be created
  + resource "azurerm_container_app" "container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "altinn-apim-test-hcpyxw-aca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "altinn-apim-test-rg"
      + revision_mode                 = "Single"

      + identity {
          + identity_ids = [
              + "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/altinn-apim-test-hcpyxw-aca-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + registry {
          + identity = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/altinn-apim-test-hcpyxw-aca-mi"
          + server   = "altinncr.azurecr.io"
        }

      + template {
          + max_replicas                     = 1
          + min_replicas                     = 0
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + args              = [
                  + "webserver",
                  + "--auth-enabled",
                ]
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "altinncr.azurecr.io/dis-hackaton/dis-demo-pgsql:latest"
              + memory            = "1Gi"
              + name              = "dis-demo-pgsql"
            }

          + http_scale_rule {
              + concurrent_requests = "1000"
              + name                = "http-scale-rule"
            }
        }
    }

  # azurerm_container_app_environment.container_app_environment will be created
  + resource "azurerm_container_app_environment" "container_app_environment" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "norwayeast"
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "altinn-apim-test-hcpyxw-acaenv"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "altinn-apim-test-rg"
      + static_ip_address                = (known after apply)
      + zone_redundancy_enabled          = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-apim-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-apim-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-apim-test-rg.tfstate.tfplan`